IDEA Open Model
AnchorParam.AnchorTypeData Property
 Gets or sets the various type of anchor.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public AnchorType AnchorTypeData { get; set; }
Public Property AnchorTypeData As AnchorType
	Get
	Set
public:
property AnchorType AnchorTypeData {
	AnchorType get ();
	void set (AnchorType value);
}
Property Value
Type: AnchorType
See Also
Reference
AnchorParam Class
IdeaRS.OpenModel.Parameters Namespace